/******************************************************************
 * 现代C++语言指的是在C++11之后，增加的方便C++开发，以及增强功能的新特性，
 * 这些特性十分繁杂，因此这里也仅测试和展示其中的一部分。
 * 本篇参考书籍:
 * <深入理解C++11:C++11新特性解析和应用>
 * <现代C++语言核心特性解析>
 * 涉及知识点
 * 1.引用
 *  左值，右值，右值引用，移动语义, 万能引用和引用折叠，完美转发
 * 2.类型推导
 *  auto，decltype
 * 3.lambda表达式
 * 4.类和类的函数
 * 委托构造函数，移动构造函数
 * 5.常量表达式(constexpr)
 * 6.改进的命名空间(namespace)
********************************************************************/
#include "modules/basic.hpp"
#include "modules/class.hpp"
#include "reference/reference.hpp"
#include "type/type.hpp"
#include "lambda/lambda.hpp"
#include "constexpr/constexpr.hpp"
#include "namespace/namespace.hpp"

int main(int argc, char *argv[])
{
    /********************************
     * 基础
    *********************************/
    //basic_process();

    /********************************
     * type
    *********************************/
    //type_process();

    /********************************
     * 类的处理
    *********************************/
    class_process();

    /********************************
     * 引用
    *********************************/
    //reference_process();

    /********************************
     * lambda标识符
    *********************************/
    //lambda_process();

    /********************************
     * constexpr
    *********************************/
    //constexpr_process();

    /********************************
     * namespace
    *********************************/
    //namespace_process();

    return 0;
}